using System.Collections;
using System.Collections.Generic;
using UnityEngine;

/************************************************************************************/
/* ProjectSettingによりこのスクリプトの優先度を高く設定する必要がある				*/
/************************************************************************************/

public class PlayerIF : MonoBehaviour
{
	/********************************************************************************/
	/*内部変数																		*/
	/********************************************************************************/
	private GameObject ObjPlayer;
	private Rigidbody RbPlayer;
	private Vector3 PosPlayer;

	/********************************************************************************/
	/* 関数名	: Start																*/
	/********************************************************************************/
	void Start()
    {
		ObjPlayer = GameObject.Find("Player");
		RbPlayer = ObjPlayer.GetComponent<Rigidbody>();
		PosPlayer = ObjPlayer.transform.position;
    }

	/********************************************************************************/
	/* 関数名	: Upadate															*/
	/********************************************************************************/
	void Update()
    {
		PosPlayer = ObjPlayer.transform.position;
	}

	/********************************************************************************/
	/* 関数名	: RbPlayer渡し関数													*/
	/********************************************************************************/
	public Rigidbody GetPlayerRb()
	{
		return RbPlayer;
	}

	/********************************************************************************/
	/* 関数名	: PosPlayer渡し関数												*/
	/********************************************************************************/
	public Vector3 GetPlayerPos()
	{
		return PosPlayer;
	}
}
